package lesson.Day08_03_Static;

/**
 * static 【静态属性】
 * 静态变量在类加载的时候初始化，内存在方法区中开辟，访问的时候不需要创建对象，
 * 直接使用“类名.静态变量名”的方式访问
 * 也可以使用“引用.xx”的方式，但不建议
 * static:
 * --> 1. 使用 static 修饰的方法： 静态方法
 * --> 2. 使用 static 修饰的变量： 静态变量
 * --> 3. 所有的 static 修饰的元素都称为静态的，
 * --> 4. static 修饰的所有元素，都是类级别的特征，和具体对象无关
 * --> 5. 静态方法中，无法直接访问实例变量、实例方法
 * 何时定义为静态方法？：
 * --> 这个动作不需要对象的参与时， 可定义为静态方法
 */
public class Index {
    /**
     *
     * 静态属性
     * 实例变量
     *
     * 静态代码块
     *
     * 主方法
     *
     * 实例代码块
     *
     * 构造方法
     *
     * 静态方法
     * 实例方法
     *
     * */
}
